Repository: jingcjie/WDCableWUI
Catalog: Strings/*/Resources.resw
Source language: en
Languages: zh_cn

# Settings_Title.Text
source: Settings
zh_cn: 设置

# Settings_Description.Text
source: Customize your WiFi Direct Cable experience
zh_cn: 自定义您的WiFi直连线缆体验

# Settings_Language_Title.Text
source: Language
zh_cn: 语言

# Settings_Language_Description.Text
source: Choose your preferred language for the application
zh_cn: 选择您偏好的应用程序语言

# Settings_Language_ComboBox.Header
source: Language
zh_cn: 语言

# Settings_Language_FollowSystem.Content
source: Follow System
zh_cn: 跟随系统

# Settings_Language_English.Content
source: English
zh_cn: English (英语)

# Settings_Language_Chinese.Content
source: 中文 (Chinese)
zh_cn: 中文

# Settings_Appearance_Title.Text
source: Appearance
zh_cn: 外观

# Settings_Appearance_Description.Text
source: Customize the look and feel of the application
zh_cn: 自定义应用程序的外观和感觉

# Settings_Theme_ComboBox.Header
source: Theme
zh_cn: 主题

# Settings_Theme_Default.Content
source: Use system setting
zh_cn: 使用系统设置

# Settings_Theme_Light.Content
source: Light
zh_cn: 浅色

# Settings_Theme_Dark.Content
source: Dark
zh_cn: 深色

# Settings_About_Title.Text
source: About
zh_cn: 关于

# Settings_Language_Changed_Title
source: Language Changed
zh_cn: 语言已更改

# Settings_Language_Changed_Content
source: The language has been changed successfully.
zh_cn: 语言已成功更改。

# Settings_Language_Changed_OK
source: OK
zh_cn: 确定

# Settings_About_Description.Text
source: Information about WiFi Direct Cable
zh_cn: WiFi直连线缆的相关信息

# Settings_About_AppName.Text
source: WiFi Direct Cable
zh_cn: WiFi直连线缆

# Settings_About_Copyright.Text
source: © 2025 WiFi Direct Cable. All rights reserved.
zh_cn: © 2025-2026 WiFi直连线缆。保留所有权利。

# Settings_GitHub_Title.Text
source: Source Code
zh_cn: 源代码

# Settings_GitHub_Description.Text
source: View the source code repo.
zh_cn: 查看源代码仓库

# Settings_GitHub_Windows_Title.Text
source: Windows Version
zh_cn: Windows版本

# Settings_GitHub_Windows_Description.Text
source: WDCableWUI - Windows UWP application
zh_cn: WDCableWUI - Windows UWP应用程序

# Settings_GitHub_Android_Title.Text
source: Android Version
zh_cn: Android版本

# Settings_GitHub_Android_Description.Text
source: WDCable Flutter - Cross-platform mobile app
zh_cn: WDCable Flutter - 跨平台移动应用

# FileTransfer_Browse_Button.Content
source: Browse
zh_cn: 浏览

# FileTransfer_AutoReceive_Description.Text
source: Files will be automatically received when the app is running.
zh_cn: 应用程序运行时将自动接收文件。

# FileTransfer_Records_Title.Text
source: Transfer Records
zh_cn: 传输记录

# FileTransfer_Filter_All.Content
source: All
zh_cn: 全部

# FileTransfer_Filter_Sent.Content
source: Sent
zh_cn: 已发送

# FileTransfer_Filter_Received.Content
source: Received
zh_cn: 已接收

# MainWindow_AppTitle.Text
source: WiFi Direct Cable
zh_cn: WiFi直连线缆

# MainWindow_Navigation_Connection.Content
source: Connection
zh_cn: 连接

# MainWindow_Navigation_Chat.Content
source: Chat
zh_cn: 聊天

# MainWindow_Navigation_SpeedTest.Content
source: Speed Test
zh_cn: 速度测试

# MainWindow_Navigation_FileTransfer.Content
source: File Transfer
zh_cn: 文件传输

# MainWindow_Navigation_Settings.Content
source: Settings
zh_cn: 设置

# Connection_Title.Text
source: WiFi Direct Connection
zh_cn: WiFi直连连接

# Connection_Description.Text
source: Connect and share files with nearby devices using WiFi Direct
zh_cn: 使用WiFi直连与附近设备连接并共享文件

# Connection_DeviceVisibility_Title.Text
source: Device Visibility
zh_cn: 设备可见性

# Connection_DeviceVisibility_Description.Text
source: Make this device discoverable by other WiFi Direct devices
zh_cn: 让其他WiFi直连设备可以发现此设备

# Connection_DeviceDiscovery_Title.Text
source: Device Discovery
zh_cn: 设备发现

# Connection_DeviceDiscovery_Description.Text
source: Scan for nearby WiFi Direct devices
zh_cn: 扫描附近的WiFi直连设备

# Connection_Status_Title.Text
source: Connection Status
zh_cn: 连接状态

# Connection_Status_NotConnected.Text
source: Not connected
zh_cn: 未连接

# Connection_AvailableDevices_Title.Text
source: Available Devices
zh_cn: 可用设备

# Connection_AvailableDevices_Description.Text
source: Devices found during scan will appear here
zh_cn: 扫描发现的设备将显示在这里

# Connection_NoDevices_Title.Text
source: No devices found
zh_cn: 未发现设备

# Connection_NoDevices_Description.Text
source: Start scanning to discover nearby devices
zh_cn: 开始扫描以发现附近的设备

# Chat_Title.Text
source: Chat Communication
zh_cn: 聊天通信

# Chat_Description.Text
source: Send and receive messages with the connected device
zh_cn: 与连接的设备发送和接收消息

# Chat_Status_Disconnected.Text
source: Disconnected
zh_cn: 已断开连接

# Chat_NoMessages_Title.Text
source: No messages yet
zh_cn: 暂无消息

# Chat_NoMessages_Description.Text
source: Start a conversation by typing a message below
zh_cn: 在下方输入消息开始对话

# Chat_ConnectionRequired_Title.Text
source: WiFi Direct Connection Required
zh_cn: 需要WiFi直连连接

# Chat_ConnectionRequired_Description.Text
source: Please establish a WiFi Direct connection to start chatting
zh_cn: 请建立WiFi直连连接以开始聊天

# Chat_MessageInput.PlaceholderText
source: Type a message...
zh_cn: 输入消息...

# SpeedTest_Title.Text
source: Network Speed Test
zh_cn: 网络速度测试

# SpeedTest_Description.Text
source: Test upload and download speeds with the connected device
zh_cn: 测试与连接设备的上传和下载速度

# SpeedTest_NotConnected_Title.Text
source: Not Connected
zh_cn: 未连接

# SpeedTest_NotConnected_Description.Text
source: Establish a connection to begin speed testing
zh_cn: 建立连接以开始速度测试

# SpeedTest_Upload_Title.Text
source: Upload Test
zh_cn: 上传测试

# SpeedTest_Download_Title.Text
source: Download Test
zh_cn: 下载测试

# SpeedTest_Results_Title.Text
source: Test Results
zh_cn: 测试结果

# SpeedTest_NoResults_Title.Text
source: No test results yet
zh_cn: 暂无测试结果

# SpeedTest_NoResults_Description.Text
source: Run upload or download tests to see results here
zh_cn: 运行上传或下载测试以查看结果

# FileTransfer_Title.Text
source: File Transfer
zh_cn: 文件传输

# FileTransfer_Description.Text
source: Send and receive files with the connected device
zh_cn: 与连接的设备发送和接收文件

# FileTransfer_Send_Title.Text
source: Send Files
zh_cn: 发送文件

# FileTransfer_DragDrop.Text
source: Drag a file here or click to browse
zh_cn: 将文件拖拽到此处或点击浏览

# FileTransfer_SelectedFile.Text
source: Selected File:
zh_cn: 选择的文件：

# FileTransfer_Receive_Title.Text
source: Receive Settings
zh_cn: 接收设置

# FileTransfer_DownloadLocation.Text
source: Download Location:
zh_cn: 下载位置：

# FileTransfer_AutoReceive.Text
source: Files will be automatically received when the app is running.
zh_cn: 应用程序运行时将自动接收文件。

# MainWindow_PageTitle_Connection.Text
source: Connection
zh_cn: 连接

# MainWindow_Status_Ready.Text
source: Ready
zh_cn: 就绪

# MainWindow_Status_Disconnected.Text
source: Disconnected
zh_cn: 已断开连接

# MainWindow_Status_NoDevice.Text
source: No device connected
zh_cn: 未连接设备

# MainWindow_PageTitle_Chat
source: Chat
zh_cn: 聊天

# MainWindow_PageTitle_SpeedTest
source: Speed Test
zh_cn: 速度测试

# MainWindow_PageTitle_FileTransfer
source: File Transfer
zh_cn: 文件传输

# MainWindow_PageTitle_Settings
source: Settings
zh_cn: 设置

# FileTransfer_DragDrop_Description.Text
source: Drag a file here or click to browse
zh_cn: 将文件拖拽到此处或点击浏览

# FileTransfer_Send_Button.Content
source: Send
zh_cn: 发送

# FileTransfer_DownloadLocation_Label.Text
source: Download Location:
zh_cn: 下载位置：

# SpeedTest_Status_NotConnected.Text
source: Not Connected
zh_cn: 未连接

# SpeedTest_Status_Description.Text
source: Establish a connection to begin speed testing
zh_cn: 建立连接以开始速度测试

# SpeedTest_RefreshButton.Content
source: Refresh
zh_cn: 刷新

# SpeedTest_TestSize_Header
source: Test Size
zh_cn: 测试大小

# SpeedTest_StartUpload_Button.Content
source: Start Upload Test
zh_cn: 开始上传测试

# SpeedTest_StartDownload_Button.Content
source: Start Download Test
zh_cn: 开始下载测试

# SpeedTest_ClearHistory_Button.Content
source: Clear History
zh_cn: 清除历史

# Chat_ClearHistory.Content
source: Clear History
zh_cn: 清除历史

# Chat_ClearHistory_Text.Text
source: Clear all chat messages
zh_cn: 清除所有聊天消息

# Connection_ScanButton.Content
source: Start Scan
zh_cn: 开始扫描

# Connection_StopScanButton.Content
source: Stop Scan
zh_cn: 停止扫描

# Connection_ConnectButton.Content
source: Connect
zh_cn: 连接

# Connection_DisconnectButton.Content
source: Disconnect
zh_cn: 断开连接

# FileTransfer_ClearAllRecords.Content
source: Clear All Records
zh_cn: 清除所有记录
